app/Http/Controllers/AnswersController.php

    public function update(Request $request, Question $question, Answer $answer)
    {
        $this->authorize('update', $answer);

        $answer->update($request->validate([
            'body' => 'required'
        ]));
---
update `answers` set `body` = 'Numquam ipsa officia cum consequatur et dolores. Sunt possimus sunt aut pariatur qui corrupti a. Fuga provident quaerat ratione molestias est. Ducimus dolores nulla voluptates aperiam laudantium.\n\nNeque qui aliquid omnis quia beatae vel nesciunt. Aut officia ut nihil. Harum impedit dolores officia dolor doloribus reiciendis ducimus. Similique error perspiciatis ut eaque. Nam tempore omnis voluptas ea consequuntur mollitia delectus.\n\nQuaerat sunt pariatur debitis vel dolores. Mollitia aspernatur enim explicabo quia. Inventore dicta consequuntur nostrum sequi. Dolores culpa laborum reprehenderit error perferendis hic.\n\nPossimus tenetur rerum nisi hic alias id dolor. Et eius est rerum fuga illum laudantium modi iusto. Et tenetur non placeat libero totam.', `updated_at` = '2019-10-03 06:21:35' where `id` = 2

    public function destroy(Question $question, Answer $answer)
    {
        $this->authorize('delete', $answer);

        $answer->delete();
---
delete from `answers` where `id` = 33