app/Http/Controllers/AnswersController.php

select * from `users` where `users`.`id` in (1, 3)
---
    public function index(Question $question)
    {
        return $question->answers()->with('user')->simplePaginate(3);

select * from `users` where `users`.`id` in (1)
---
    public function store(Question $question, Request $request)
    {
        /*$request->validate([
            'body' => 'required'
        ]);*/
        //$question->answers()->create(['body'=>$request->body, 'user_id'=>\Auth::id()]);

        // since Laravel v5.4 validate method returns data array if validation passes, so we can use it
        $answer = $question->answers()->create($request->validate([
            'body' => 'required'
        ]) + ['user_id'=>\Auth::id()]);

        if ($request->expectsJson()) {
            return response()->json([
                'message' => 'Your answer has been submitted successfully!',
                'answer' => $answer->load('user')

delete from `answers` where `id` = 31
---
    public function destroy(Question $question, Answer $answer)
    {
        $this->authorize('delete', $answer);

        $answer->delete();