app/Http/Controllers/FavoritesController.php

    public function store(Question $question)
    {
        $question->favorites()->attach(auth()->id());
---
insert into `favorites` (`created_at`, `question_id`, `updated_at`, `user_id`) values ('2019-10-03 19:30:53', 2, '2019-10-03 19:30:53', 2)