app/Http/Controllers/QuestionsController.php

select * from `questions` order by `created_at` desc limit 5 offset 0
select * from `users` where `users`.`id` in (1, 3)
select count(*) as aggregate from `questions`
---
    public function index()
    {
        // analysing query by using DB::enableQueryLog()
        //\DB::enableQueryLog();
        $questions = Question::with('user')->latest()->paginate(5);

update `questions` set `views` = `views` + 1, `updated_at` = '2019-10-04 19:13:55' where `id` = 2
---
    public function show(Question $question)
    {
        $question->increment('views');

delete from `questions` where `id` = 12
---
    public function destroy(Question $question)
    {
        // Authorization using Gate
        //if (\Gate::allows('delete-question', $question)) {
            // execute delete
        //}
        // or
        /*if (\Gate::denies('delete-question', $question)) {
            abort('403', 'Access denied.');
        }*/

        // Authorization using Policy
        $this->authorize('delete', $question);

        $question->delete();