app/Models/Answer.php

update `questions` set `answers_count` = `answers_count` - 1, `updated_at` = '2019-09-22 08:04:29' where `id` = 9
update `questions` set `answers_count` = `answers_count` + 1, `updated_at` = '2019-10-07 07:46:27' where `id` = 5
---
    public static function boot()
    {
        parent::boot();

        /* ELOQUENT EVENTS */
        // creating Laravel lifecycle hook: created(closure function which accepts current
        // model instance as argument)
        static::created(function ($answer) {
            // answers_count is a column of questions table
            $answer->question->increment('answers_count');
        });

        static::deleted(function ($answer) {
            $question = $answer->question;
            $question->decrement('answers_count');