app/Models/Question.php

update `questions` set `best_answer_id` = 2, `updated_at` = '2019-10-04 19:23:47' where `id` = 2
---
    public function acceptBestAnswer(Answer $answer)
    {
        $this->best_answer_id = $answer->id;
        $this->save();