app/Models/Question.php

    public function acceptBestAnswer(Answer $answer)
    {
        $this->best_answer_id = $answer->id;
        $this->save();
---
update `questions` set `best_answer_id` = 11, `updated_at` = '2019-09-28 06:13:25' where `id` = 4