app/Models/User.php

    public function voteQuestion(Question $question, $vote)
    {
        $voteQuestions = $this->voteQuestions();

        if ($voteQuestions->where('votable_id', $question->id)->exists()) {
            $voteQuestions->updateExistingPivot($question, ['vote' => $vote]);
        } else {
            $voteQuestions->attach($question, ['vote' => $vote]);
        }

        // refresh the relationship
        $question->load('votes');

        $upVotes = (int)$question->upVotes()->sum('vote');
        $downVotes = (int)$question->downVotes()->sum('vote');

        $question->votes_count = ($upVotes + $downVotes);
        $question->save();
---
update `questions` set `votes_count` = 2, `updated_at` = '2019-09-28 06:10:08' where `id` = 1

    public function voteAnswer(Answer $answer, $vote)
    {
        $voteAnswers = $this->voteAnswers();

        if ($voteAnswers->where('votable_id', $answer->id)->exists()) {
            $voteAnswers->updateExistingPivot($answer, ['vote' => $vote]);
        } else {
            $voteAnswers->attach($answer, ['vote' => $vote]);
        }

        // refresh the relationship
        $answer->load('votes');

        $upVotes = (int)$answer->upVotes()->sum('vote');
        $downVotes = (int)$answer->downVotes()->sum('vote');

        $answer->votes_count = ($upVotes + $downVotes);
        $answer->save();
---
update `answers` set `votes_count` = -1, `updated_at` = '2019-09-28 19:14:14' where `id` = 36
update `votables` set `vote` = 1, `updated_at` = '2019-10-07 06:41:46' where `user_id` = 1 and `votable_type` = 'App\Models\Question' and `votable_id` = 4
insert into `votables` (`user_id`, `votable_id`, `votable_type`, `vote`) values (2, 1, 'App\Models\Question', -1)
update `answers` set `votes_count` = 1, `updated_at` = '2019-10-07 05:49:01' where `id` = 11