app/Providers/RouteServiceProvider.php

    public function boot()
    {
        Route::bind('slug', function ($slug) {
            return Question::with('user')->where('slug', $slug)->first() ?? abort('404');

            // commented when fetching answers logic applied on Answers.vue file by ajax
            //return Question::with(['user', 'answers.user'])->where('slug', $slug)->first() ?? abort('404');

            // commented when orderByDesc('votes_count') apply on question model answers()
            // relationship function
            /*return Question::with(['answers.user', 'answers'=> function($query) {
                $query->orderByDesc('votes_count');
            }])->where('slug', $slug)->first() ?? abort('404');*/
        });
---
select * from `answers` where `answers`.`question_id` in (2) order by `votes_count` desc
select * from `questions` where `slug` = 'autem-similique-qui-nesciunt' limit 1
select * from `users` where `users`.`id` in (1)